import React from "react";

class MM01 extends React.Component {
  render() {
    return (
      <div className="MM01">
        <div className="MM01__title">르네상스(1400~1650)</div>
        <div className="MM01__desc">
          <div className="MM01__composer">주요 작곡가</div>
          <div className="MM01__composer__introduce">
            <p>조스켕 데 프레 (1450? ~ 1521) </p>
            <p>조반니 피에를루이지 다 팔레스트리나 (1525? ~ 1594)</p>
            <p> 요하네스 오케겜 (1420? ~ 1497) </p>
            <p>토마스 루이스 데 빅토리아 (1548 ~ 1611)</p>
            <p>존 던스터블 (1390 ~ 1453) </p> <p>토마스 탈리스 (1506 ~ 1585)</p>
            <p>오를란도 디 라소 (1532? ~ 1594) </p>
            <p>조반니 가브리엘리 (1557 ~ 1612)</p>
            <p>카를로 제수알도 (1566 ~ 1613)</p>
            <p>앙투안 브루멜 (1462? ~ 1513) </p>
            <p>히에로니무스 프레토리우스 (1560 ~ 1629) </p>
            <p>존 셰퍼드 (1515? ~ 1558)</p>
            <p> 디에고 오르티츠 (1510? ~ 1570)</p>
          </div>
          <div className="MM01__point">특징</div>
          <div className="MM01__point__desc">
            <p>
              (1) 종교적목적뿐만 아니라, 미학적 만족, 즐거움을 위한 목적으로써의
              음악
            </p>
            <p>
              (2) 일상생활에서 중요한 목적을 지닌 음악 - 결혼, 환영, 송별, 행렬,
              종교의식 등 다양한 행사에서 훌륭하게 차려입은 연주자들이 참여
            </p>
            <p>
              (3) 독자적 기악음악 양식 생김으로써 성악음악 뿐만 아니라
              기악음악도 흔히 들을수 있게됨
            </p>
            <p>(4) 노래부르기 쉬운 선율</p>
            <p>
              (5) 대부분 대위법적으로 쓰여짐 - 서로 모방하는 네 성부의 짜임새가
              유행
            </p>
            <p>
              (6) 교회선법에 기초. but, 더 독창적이고 자유로운 구사. 16세기 말,
              교회선법체계의 붕괴, 장조 단조 체계로 변화되려는 징조 보임
            </p>
            <p>
              (7) 미사의 모든 악장에 같은 정선율을 사용하여 연작미사(cyclic
              mass) 작곡 종교적 면보다 미학적,예술적 측면 강조. 중세
              정선율기법을 확장
            </p>
            <p>
              (8) 르네상스 작곡가들의 태도 : 창작적인 예술가. 교회음악에
              구속되지 않음
            </p>
            <p>(9) 인쇄술 발달 - 악보의 대량보급이 가능하게 됨.</p>
          </div>
        </div>
      </div>
    );
  }
}

export default MM01;
