import React from "react";

class MM03 extends React.Component {
  render() {
    return (
      <div className="MM03">
        <div className="MM03__title">고전주의(1750~1820)</div>
        <div className="MM03__desc">
          <div className="MM03__composer">주요 작곡가</div>
          <div className="MM03__composer__introduce">
            <p>크리스토프 빌리발트 글루크 (1714 ~ 1787)</p>
            <p>빌헬름 프리드만 바흐 (1710 ~ 1784)</p>
            <p>요한 크리스티안 바흐 (1735 ~ 1782)</p>
            <p>카를 필립 엠마누엘 바흐 (1714 ~ 1788)</p>
            <p>레오폴트 모차르트 (1719 ~ 1787)</p>
            <p>루이지 보케리니 (1743 ~ 1805)</p>
            <p>프란츠 요제프 하이든 (1732 ~ 1809)</p>
            <p>프랑수아조제프 고세크 (1734 ~ 1829)</p>
            <p>볼프강 아마데우스 모차르트 (1756 ~ 1791)</p>
            <p>루트비히 판 베토벤 (1770 ~ 1827)</p>
            <p>안토니오 살리에리 (1750 ~ 1825)</p>
            <p>페르난도 소르 (1778 ~ 1839)</p>
            <p>카를 체르니 (1791 ~ 1857)</p>
            <p>요한 네포무크 훔멜 (1778 ~ 1837)</p>
          </div>
          <div className="MM03__point">특징</div>
          <div className="MM03__point__desc">
            <p>
              (1) 바로크 시대의 장식적이고 화려한 음악스타일이 간결하고 선명한
              음악으로 바뀌었으며 복잡한 대위법 보다는 합리적인 화성기법으로
              사용됨.
            </p>
            <p>
              (2) 이 시대에는 제시부,전개부,재현부의 3부분으로 이루어진 대규모의
              악곡 형식인 소나타 형식이 발전하여 교향곡, 근대적인 협주곡, 현악
              중주 같은 실내악, 피아노 독주곡 같은 기악음악이 발달함.
            </p>
            <p>
              (3) 악기의 연주법과 기능이 발달하면서 다양한 연주기교가 발달하기
              시작하였고 고전주의를 대표하는 악기인 피아노가 널리 번성한 시기다.
            </p>
            <p>
              (4) 숫자저음에 의한 당시의 기법은 파기되었으며 독일과
              오스트리아에서는 음악이 크게 발전함.
            </p>
            <p>
              (5) 성악보다는 기악이 우위로 되었고 소나타 형식과 소나타 구조의
              확립을 보임.
            </p>
            <p>
              (6) 고전음악이 작품으로 나타난 것은 피아노 소나타가 중심이였으며
              현악 4중주 등 실내악의 발달을 볼 수 있음.
            </p>
            <p>
              (7) 피아노 협주곡을 위시한 협주곡이 소나타 주고에 이해
              만들어졌으며 서곡과 교향곡의 전성을 보였고 소나타 형식에
              제시부-발전부-재현부와 론도 형식과 악장 구성의 확립을 보임.
            </p>
          </div>
        </div>
      </div>
    );
  }
}

export default MM03;
