import React from "react";
import romance from "../img/romance";

class MM04 extends React.Component {
  render() {
    return (
      <div className="MM04">
        <div className="MM04__title">낭만주의(1820~1910)</div>
        <div className="MM04__desc">
          <div className="MM04__composer">주요 작곡가</div>
          <div className="MM04__composer__introduce">
            <p>조아키노 로시니(1792 ~ 1868)</p>
            <p>샤를 구노 (1818 ~ 1893)</p>
            <p>알렉산드르 글라주노프 (1865 ~ 1936)</p>
            <p>미하일 글린카 (1803 ~ 1857)</p>
            <p>세르게이 라흐마니노프 (1873 ~ 1943)</p>
            <p>니콜라이 림스키코르사코프 (1844 ~ 1908)</p>
            <p>피에트로 마스카니 (1863 ~ 1945)</p>
            <p>펠릭스 멘델스존 (1809 ~ 1847)</p>
            <p>리하르트 바그너 (1813 ~ 1883)</p>
            <p>주세페 베르디 (1813 ~ 1901)</p>
            <p>프레데리크 쇼팽 (1810 ~ 1849)</p>
            <p>프란츠 슈베르트 (1797 ~ 1828)</p>
            <p>니콜로 파가니니 (1782 ~ 1840)</p>
            <p>자코모 푸치니 (1858 ~ 1924)</p>
            <p>표트르 일리치 차이콥스키 (1840 ~ 1893)</p>
          </div>
          <div className="MM04__point">특징</div>
          <div className="MM04__point__desc">
            <p>
              (1) 낭만시대의 음악은 문학작품같은 감성적이고 예술적인 측면이
              강함.
            </p>
            <p>
              (2) 예술가곡 - 피아노 반주와 성악 성부로 구성되어 감성적이고
              낭만적인 음악이 많이 나옴.
            </p>
            <p>
              (3) 오페라 - 오페라는 이전의 민속적인 요소와 시대적인 낭만 소재가
              조화되어 발전함.
            </p>
            <p>
              (4) 피아노곡 - 고전시대에서 낭만시대로 넘어와서 소나타형식에서
              소품의 성격으로 바뀌었으며 낭만적인 정서가 잘 나타남.
            </p>
            <p>
              (5) 교향곡 - 교향곡은 특히 표제교향곡이라는 명칭으로 낭만시대만의
              특징이 두드러짐. 베를리오주의 교향곡이 유명.
            </p>
            <p>
              (6) 협주곡 - 낭만시대에는 피아노와 바이올린을 위한 협주곡이 인기가
              높았음.
            </p>
            <p>
              (7) 실내악곡 - 낭만시대에 피아노가 개량되어 특히 피아노가 포함된
              실내악곡들이 많았음.
            </p>
          </div>
        </div>
      </div>
    );
  }
}

export default MM04;
